data_gathering/informe_data_gathering/primer_concepto.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-22 Fri 15:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Primer Concepto -Análisis del estado de las bandas musicales en la escena colombiana</title>
<meta name="author" content="Rodrigo Castillo, Alejandra Campo, Gran Maestro Chamán." />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Primer Concepto -Análisis del estado de las bandas musicales en la escena colombiana</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org247b1c8">1. Qué base de datos escogieron.</a>
<ul>
<li><a href="#org4d9d1be">1.1. Metodología de la recolección de datos sobre bandas en la escena colombiana</a>
<ul>
<li><a href="#org9f9ae55">1.1.1. SIMUS</a></li>
<li><a href="#orgcdf1018">1.1.2. BOMM (Bogotá Music Market)</a></li>
<li><a href="#orgf2e9690">1.1.3. Bandas o cantantes famosos</a></li>
<li><a href="#org565a6dc">1.1.4. Sin embargo, lo que se pretende con estos datos es extraer solamente los nombres de las bandas activas en la escena colombiana, pues, posteriormente, a partir de estas bandas se obtendrá la información de spotify, por lo que unificaré los datos.</a></li>
</ul>
</li>
<li><a href="#org10b9772">1.2. Merge con Spotify:</a>
<ul>
<li><a href="#org816b6f5">1.2.1. Concepto</a></li>
<li><a href="#orgf790ba0">1.2.2. Proceso de enriquecer los datos:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org482fe9d">2. Razón por la cuál elegimos esta base de datos:</a>
<ul>
<li><a href="#orgd32f92e">2.1. 1</a></li>
<li><a href="#orgb7eeaf6">2.2. 2</a></li>
<li><a href="#org1d4f98d">2.3. 3</a></li>
</ul>
</li>
<li><a href="#orgbb9984b">3. Qué métodos pueden potencialmente aplicarse con dicha base de datos.</a>
<ul>
<li><a href="#orgf263654">3.1. Respecto a la comparación:</a></li>
<li><a href="#org4204764">3.2. Respecto a la clasificación:</a></li>
<li><a href="#org986526c">3.3. Respecto al clustering:</a></li>
<li><a href="#org09f10b4">3.4. Respecto a la reducción de dimensionalidad:</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org247b1c8" class="outline-2">
<h2 id="org247b1c8"><span class="section-number-2">1.</span> Qué base de datos escogieron.</h2>
<div class="outline-text-2" id="text-1">
<p>
La idea de este proyecto es hacer un análisis del estado de las bandas musicales
en la escena musical colombiana, sin embargo, aunque existen muchas bases de
datos y formas diversas
de recolectar datos sobre música, no existe un dataset sólido sobre la música en
Colombia que cuente con suficientes features para aplicar análisis estadístico
de datos en ellos. La mayoría de las plataformas (como spotify) que cuentan con
una API no dan información sobre la región en donde se encuenta un artista.
</p>

<p>
Sin embargo, no tiene gracia hacer análisis de datos sobre grandes datasets que
no tienen influencia sobre los miembros del grupo y sobre los cuales ya existen
análisis muy complejos hechos por gente mas experimentada, por lo que el grupo
se dispuso a hacer su propio dataframe de la música en Colombia.
</p>
</div>

<div id="outline-container-org4d9d1be" class="outline-3">
<h3 id="org4d9d1be"><span class="section-number-3">1.1.</span> Metodología de la recolección de datos sobre bandas en la escena colombiana</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org9f9ae55" class="outline-4">
<h4 id="org9f9ae55"><span class="section-number-4">1.1.1.</span> SIMUS</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Existen diversos datos sobre bandas colombianas , por ejemplo existe una entidad que se llama el SIMUS en el cuál las bandas musicales que tienen contrataciones tienen que registratse legalmente, esta base de datos cuenta con 882 bandas que se han registrado legalmente.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">import</span> pandas <span style="color: #51afef;">as</span> pd
<span style="color: #dcaeea;">datos_simus</span> = pd.read_excel(<span style="color: #98be65;">"bandas_simus.xls"</span>)
<span style="color: #51afef;">print</span>(datos_simus.head(<span style="color: #da8548; font-weight: bold;">10</span>))
<span style="color: #51afef;">print</span>(datos_simus.shape)
</pre>
</div>

<pre class="example" id="orgb2d7613">
                                            Nombre                        Tipo Agrupacion      Pais  Departamento       Municipio     Estado
0  Ensamble musical casa de la cultura San Alberto                               Conjunto  COLOMBIA         CESAR     SAN ALBERTO  Publicado
1                 Charlie Rueda &amp; The Jazzmorgans   Agrupaciones de Música Popular Urbana  COLOMBIA     SANTANDER     BUCARAMANGA  Publicado
2                                   Gente pescaito                               Conjunto  COLOMBIA  BOGOTÁ, D.C.    BOGOTÁ, D.C.  Publicado
3                                        los Andes                               Conjunto  COLOMBIA         HUILA         GIGANTE  Publicado
4                       CORO MUNICIPAL DE  MALAMBO                                   Coro  COLOMBIA     ATLÁNTICO         MALAMBO  Publicado
5                                       CORO ATRES                                   Coro  COLOMBIA        NARIÑO         IPIALES  Publicado
6                                      A TRES TRIO                                   Trio  COLOMBIA        NARIÑO         IPIALES  Publicado
7                    CUERPO Y ALMA LATIN ROCK BAND  Agrupaciones de Música Popular Urbana  COLOMBIA         HUILA     SANTA MARÍA  Publicado
8                        banda escuela 16 de julio                                  Banda  COLOMBIA       BOLÍVAR  SAN ESTANISLAO  Publicado
9       gaita casa de la cultura de san estanislao     Agrupaciones de Música Tradicional  COLOMBIA       BOLÍVAR  SAN ESTANISLAO  Publicado
(882, 6)
</pre>

<p>
En esta base de datos cuenta con las columnas:
</p>
<ul class="org-ul">
<li>nombre de la banda</li>
<li>tipo de agrupación</li>
<li>país(todas son colombianas)</li>
<li>Departamento del país</li>
<li>Municipio</li>
<li>Estado de la banda</li>
</ul>
</div>
</div>
