data_gathering/informe_data_gathering/primer_concepto.tex
% Created 2021-10-22 Fri 01:23
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Rodrigo Castillo, Alejandra Campo, Gran Maestro Chamán.}
\date{\today}
\title{Primer Concepto -Análisis del estado de las bandas musicales en la escena colombiana}
\hypersetup{
 pdfauthor={Rodrigo Castillo, Alejandra Campo, Gran Maestro Chamán.},
 pdftitle={Primer Concepto -Análisis del estado de las bandas musicales en la escena colombiana},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents



\section{Qué base de datos escogieron.}
\label{sec:orgfe3c9e9}
La idea de este proyecto es hacer un análisis del estado de las bandas musicales
en la escena musical colombiana, sin embargo, aunque existen muchas bases de
datos y formas diversas
de recolectar datos sobre música, no existe un dataset sólido sobre la música en
Colombia que cuente con suficientes features para aplicar análisis estadístico
de datos en ellos. La mayoría de las plataformas (como spotify) que cuentan con
una API no dan información sobre la región en donde se encuenta un artista.

Sin embargo, no tiene gracia hacer análisis de datos sobre grandes datasets que
no tienen influencia sobre los miembros del grupo y sobre los cuales ya existen
análisis muy complejos hechos por gente mas experimentada, por lo que el grupo
se dispuso a hacer su propio dataframe de la música en Colombia.

\subsection{Metodología de la recolección de datos sobre bandas en la escena colombiana}
\label{sec:orgbe7e7ce}
\subsubsection{SIMUS}
\label{sec:org2d391ae}
Existen diversos datos sobre bandas colombianas , por ejemplo existe una entidad que se llama el SIMUS en el cuál las bandas musicales que tienen contrataciones tienen que registratse legalmente, esta base de datos cuenta con 882 bandas que se han registrado legalmente.
\begin{verbatim}
import pandas as pd
datos_simus = pd.read_excel("bandas_simus.xls")
print(datos_simus.head(10))
print(datos_simus.shape)
\end{verbatim}

\begin{verbatim}
                                            Nombre                        Tipo Agrupacion      Pais  Departamento       Municipio     Estado
0  Ensamble musical casa de la cultura San Alberto                               Conjunto  COLOMBIA         CESAR     SAN ALBERTO  Publicado
1                 Charlie Rueda & The Jazzmorgans   Agrupaciones de Música Popular Urbana  COLOMBIA     SANTANDER     BUCARAMANGA  Publicado
2                                   Gente pescaito                               Conjunto  COLOMBIA  BOGOTÁ, D.C.    BOGOTÁ, D.C.  Publicado
3                                        los Andes                               Conjunto  COLOMBIA         HUILA         GIGANTE  Publicado
4                       CORO MUNICIPAL DE  MALAMBO                                   Coro  COLOMBIA     ATLÁNTICO         MALAMBO  Publicado
5                                       CORO ATRES                                   Coro  COLOMBIA        NARIÑO         IPIALES  Publicado
6                                      A TRES TRIO                                   Trio  COLOMBIA        NARIÑO         IPIALES  Publicado
7                    CUERPO Y ALMA LATIN ROCK BAND  Agrupaciones de Música Popular Urbana  COLOMBIA         HUILA     SANTA MARÍA  Publicado
8                        banda escuela 16 de julio                                  Banda  COLOMBIA       BOLÍVAR  SAN ESTANISLAO  Publicado
9       gaita casa de la cultura de san estanislao     Agrupaciones de Música Tradicional  COLOMBIA       BOLÍVAR  SAN ESTANISLAO  Publicado
(882, 6)
\end{verbatim}

En esta base de datos cuenta con las columnas:
\begin{itemize}
\item nombre de la banda
\item tipo de agrupación
\item país(todas son colombianas)
\item Departamento del país
\item Municipio
\item Estado de la banda
\end{itemize}
