data_gathering/informe_data_gathering/primer_concepto.html
<div id="outline-container-orgcdf1018" class="outline-4">
<h4 id="orgcdf1018"><span class="section-number-4">1.1.2.</span> BOMM (Bogotá Music Market)</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Existe una revista llamada BOMM es una plataforma de promoción y circulación organizada por la Cámara de Comercio de Bogotá, como parte de su programa de apoyo a las Industrias Creativas y Culturales, en esta página existe un catálogo de las bandas que han participado en eventos en el año 2021 (<a href="https://www.bogotamusicmarket.com/Artistas?year=2021">https://www.bogotamusicmarket.com/Artistas?year=2021</a>) (no existen mas años y este input es vulnerable a RCE injection por si alguien quiere decirle a los de BOMM).
En BOMM no existe propiamente un Dataset, sin embargo, están todas los artistas inscritos, por lo que se puede hacer un simple programa que los scrapee:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">from</span> selenium <span style="color: #51afef;">import</span> webdriver
<span style="color: #51afef;">import</span> pandas <span style="color: #51afef;">as</span> pd
<span style="color: #51afef;">from</span> time <span style="color: #51afef;">import</span> sleep
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">crea una session de un driver de google chrome</span>
<span style="color: #dcaeea;">driver</span> = webdriver.Chrome()
<span style="color: #dcaeea;">bomm_artist_url</span> = <span style="color: #98be65;">"https://www.bogotamusicmarket.com/Artistas?year=2021"</span>
driver.get(bomm_artist_url)
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">espera 1 segundo para que el driver seguro cargue la p&#225;gina</span>
sleep(<span style="color: #da8548; font-weight: bold;">1</span>)
<span style="color: #dcaeea;">not_done</span> = <span style="color: #a9a1e1;">True</span>
<span style="color: #dcaeea;">bomm_list</span> = []
<span style="color: #51afef;">while</span>(not_done):
    <span style="color: #5B6268;">#</span><span style="color: #5B6268;">agarro todos los nombres de una pagina espec&#237;fica</span>
    <span style="color: #51afef;">for</span> i <span style="color: #51afef;">in</span> <span style="color: #c678dd;">range</span>(<span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">17</span>):
        <span style="color: #5B6268;">#</span><span style="color: #5B6268;">si no se puede agarrar el elemento es porque no hay mas bandas</span>
        <span style="color: #51afef;">try</span>:
            <span style="color: #dcaeea;">first_artist</span> = driver.find_element_by_xpath(f<span style="color: #98be65;">"/html/body/div[1]/div/div/div/div[2]/div/div[{i}]/figure/figcaption/h4/a"</span>)
            <span style="color: #dcaeea;">name</span> = first_artist.text
            <span style="color: #dcaeea;">data</span> = {<span style="color: #98be65;">"band_name"</span>:name}
            bomm_list.append(data)
        <span style="color: #51afef;">except</span>:
            <span style="color: #dcaeea;">not_done</span> = <span style="color: #a9a1e1;">False</span>
            <span style="color: #51afef;">print</span>(<span style="color: #98be65;">"done"</span>)
            <span style="color: #51afef;">break</span>
    <span style="color: #51afef;">try</span>:
        <span style="color: #5B6268;">#</span><span style="color: #5B6268;">voy a la siguiente pagina, y hago esto hasta que no haya mas artistas</span>
        <span style="color: #dcaeea;">next_button</span> = driver.find_element_by_xpath(<span style="color: #98be65;">"/html/body/div[1]/div/div/div/div[3]/div[3]/div/a"</span>)
        next_button.click()
        sleep(<span style="color: #da8548; font-weight: bold;">1</span>)
    <span style="color: #51afef;">except</span>:
        driver.close()

<span style="color: #dcaeea;">bomm_data</span> = pd.DataFrame(bomm_list)
<span style="color: #51afef;">print</span>(bomm_data)
<span style="color: #51afef;">print</span>(bomm_data.shape())
</pre>
</div>

<pre class="example" id="orge2af43a">
done
              band_name
0    8bm - 8bits Memory
1         Ácido Pantera
2          Afro Legends
3    Agrupación Guarura
4             Aka Rezzo
..                  ...
252               Yooko
253               Zafat
254         Zalama Crew
255           Zatélithe
256              Zultan

[257 rows x 1 columns]
</pre>
</div>
</div>

<div id="outline-container-orgf2e9690" class="outline-4">
<h4 id="orgf2e9690"><span class="section-number-4">1.1.3.</span> Bandas o cantantes famosos</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Con el fin del proyecto, una de las cosas que se busca analizar es que factores hacen que una banda sea famosa y que otra no , por lo que también añadiré una lista de cantantes muy famosos colombianos al dataset también scrapeado de <a href="https://www.ranker.com/list/bands-from-colombia/reference">https://www.ranker.com/list/bands-from-colombia/reference</a>
</p>

<p>
<b>nota:el script que scrapeo estos datos está en el repositorio pero no se puede llamar desde el notebook pues es un poco mañoso</b>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">import</span> json
<span style="color: #51afef;">import</span> pandas <span style="color: #51afef;">as</span> pd
<span style="color: #51afef;">with</span> <span style="color: #c678dd;">open</span>(<span style="color: #98be65;">"famous_data.json"</span>) <span style="color: #51afef;">as</span> <span style="color: #c678dd;">file</span>:
    <span style="color: #dcaeea;">data</span> = json.load(<span style="color: #c678dd;">file</span>)
<span style="color: #dcaeea;">famous_dataframe</span> = pd.DataFrame(data)
<span style="color: #51afef;">print</span>(famous_dataframe)
</pre>
</div>

<pre class="example" id="org86b91d4">
                      name
0                  Shakira
1                   Juanes
2            Mateo Camargo
3        Alfredo Gutierrez
4            Alex González
..                     ...
100     Gabriel Torregrosa
101       Rafael Rodríguez
102         Fredys Arrieta
103      Alejandro Palacio
104  David Escobar Gallego

[105 rows x 1 columns]
</pre>
</div>
</div>
