data_gathering/informe_data_gathering/primer_concepto.tex
\subsubsection{BOMM (Bogotá Music Market)}
\label{sec:org519ba6d}
Existe una revista llamada BOMM es una plataforma de promoción y circulación organizada por la Cámara de Comercio de Bogotá, como parte de su programa de apoyo a las Industrias Creativas y Culturales, en esta página existe un catálogo de las bandas que han participado en eventos en el año 2021 (\url{https://www.bogotamusicmarket.com/Artistas?year=2021}) (no existen mas años y este input es vulnerable a RCE injection por si alguien quiere decirle a los de BOMM).
En BOMM no existe propiamente un Dataset, sin embargo, están todas los artistas inscritos, por lo que se puede hacer un simple programa que los scrapee:
\begin{verbatim}
from selenium import webdriver
import pandas as pd
from time import sleep
#crea una session de un driver de google chrome
driver = webdriver.Chrome()
bomm_artist_url = "https://www.bogotamusicmarket.com/Artistas?year=2021"
driver.get(bomm_artist_url)
#espera 1 segundo para que el driver seguro cargue la página
sleep(1)
not_done = True
bomm_list = []
while(not_done):
    #agarro todos los nombres de una pagina específica
    for i in range(1,17):
        #si no se puede agarrar el elemento es porque no hay mas bandas
        try:
            first_artist = driver.find_element_by_xpath(f"/html/body/div[1]/div/div/div/div[2]/div/div[{i}]/figure/figcaption/h4/a")
            name = first_artist.text
            data = {"band_name":name}
            bomm_list.append(data)
        except:
            not_done = False
            print("done")
            break
    try:
        #voy a la siguiente pagina, y hago esto hasta que no haya mas artistas
        next_button = driver.find_element_by_xpath("/html/body/div[1]/div/div/div/div[3]/div[3]/div/a")
        next_button.click()
        sleep(1)
    except:
        driver.close()

bomm_data = pd.DataFrame(bomm_list)
print(bomm_data)
print(bomm_data.shape())
\end{verbatim}

\begin{verbatim}
done
              band_name
0    8bm - 8bits Memory
1         Ácido Pantera
2          Afro Legends
3    Agrupación Guarura
4             Aka Rezzo
..                  ...
252               Yooko
253               Zafat
254         Zalama Crew
255           Zatélithe
256              Zultan

[257 rows x 1 columns]
\end{verbatim}

\subsubsection{Bandas o cantantes famosos}
\label{sec:org18bd128}
Con el fin del proyecto, una de las cosas que se busca analizar es que factores hacen que una banda sea famosa y que otra no , por lo que también añadiré una lista de cantantes muy famosos colombianos al dataset también scrapeado de \url{https://www.ranker.com/list/bands-from-colombia/reference}

\textbf{nota:el script que scrapeo estos datos está en el repositorio pero no se puede llamar desde el notebook pues es un poco mañoso}

\begin{verbatim}
import json
import pandas as pd
with open("famous_data.json") as file:
    data = json.load(file)
famous_dataframe = pd.DataFrame(data)
print(famous_dataframe)
\end{verbatim}

\begin{verbatim}
                      name
0                  Shakira
1                   Juanes
2            Mateo Camargo
3        Alfredo Gutierrez
4            Alex González
..                     ...
100     Gabriel Torregrosa
101       Rafael Rodríguez
102         Fredys Arrieta
103      Alejandro Palacio
104  David Escobar Gallego

[105 rows x 1 columns]
\end{verbatim}
