data_gathering/informe_data_gathering/primer_concepto.org
*** Sin embargo, lo que se pretende con estos datos es extraer solamente los nombres de las bandas activas en la escena colombiana, pues, posteriormente, a partir de estas bandas se obtendrá la información de spotify, por lo que unificaré los datos.

#+begin_src python :results output :exports both :session simus
import pandas as pd

colombia_scene_list = []
#añado los datos del dataframe que hice de famosos previamente
for i in famous_dataframe["name"]:
    data = {"name":i,
            "lugar_extraido":"pagina_artistas_famosos"}
    colombia_scene_list.append(data)

#añado los datos de circulart
for i in circulart_data["name"]:
    data = {"name":i,
            "lugar_extraido":"circulart"}
    colombia_scene_list.append(data)
#añado los datos del dataframe que hice de BOMM previamente
for i in bomm_data["band_name"]:
    data = {"name":i,
            "lugar_extraido":"bomm"}
    colombia_scene_list.append(data)

#añado los datos que descargue del SIMUS
for i in datos_simus["Nombre"]:
    data = {"name":i,
            "lugar_extraido":"simus"}
    colombia_scene_list.append(data)

colombia_state_names = pd.DataFrame(colombia_scene_list)
#
#guardo los datos para vincularlos posteriormente con spotify y con youtube
colombia_state_names.to_csv("nombres_bandas_generados.csv")
print(colombia_state_names.tail(5))
#+end_src

#+RESULTS:
:                                                    name lugar_extraido
: 1239  Semillero escuela Municipal de música de Piendamó          simus
: 1240                   Chirimia del Pacifico Colombiano          simus
: 1241            ESCUELA DE FORMACION MUSICAL PAEZ VIVE           simus
: 1242                                   Pal' Lereo Pabla          simus
: 1243                                       Mar a fuera           simus

** Merge con Spotify:
*** Concepto
Spotify cuenta con una API bastante completa que suministra mucha información
sobre las bandas que se encuentran en esta plataforma. Ya que se tiene un
dataset con muchos nombres de bandas que suenan en la escena de
la música colombiana, ahora lo que busco es enriquecer los datos que tengo
buscando los nombres de las bandas en spotify y extrayendo sus features. En un
proyecto anterior, junto con Juan Pablo, habíamos hecho una clase que funcionaba
dentro de la API de spotify para relacionar nombres de artistas con sus
respectivos ids en spotify

