data_gathering/informe_data_gathering/primer_concepto.html

<div id="outline-container-org565a6dc" class="outline-4">
<h4 id="org565a6dc"><span class="section-number-4">1.1.4.</span> Sin embargo, lo que se pretende con estos datos es extraer solamente los nombres de las bandas activas en la escena colombiana, pues, posteriormente, a partir de estas bandas se obtendrá la información de spotify, por lo que unificaré los datos.</h4>
<div class="outline-text-4" id="text-1-1-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">import</span> pandas <span style="color: #51afef;">as</span> pd

<span style="color: #dcaeea;">colombia_scene_list</span> = []
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">a&#241;ado los datos del dataframe que hice de famosos previamente</span>
<span style="color: #51afef;">for</span> i <span style="color: #51afef;">in</span> famous_dataframe[<span style="color: #98be65;">"name"</span>]:
    <span style="color: #dcaeea;">data</span> = {<span style="color: #98be65;">"name"</span>:i,
            <span style="color: #98be65;">"lugar_extraido"</span>:<span style="color: #98be65;">"pagina_artistas_famosos"</span>}
    colombia_scene_list.append(data)

<span style="color: #5B6268;">#</span><span style="color: #5B6268;">a&#241;ado los datos del dataframe que hice de BOMM previamente</span>
<span style="color: #51afef;">for</span> i <span style="color: #51afef;">in</span> bomm_data[<span style="color: #98be65;">"band_name"</span>]:
    <span style="color: #dcaeea;">data</span> = {<span style="color: #98be65;">"name"</span>:i,
            <span style="color: #98be65;">"lugar_extraido"</span>:<span style="color: #98be65;">"bomm"</span>}
    colombia_scene_list.append(data)

<span style="color: #5B6268;">#</span><span style="color: #5B6268;">a&#241;ado los datos que descargue del SIMUS</span>
<span style="color: #51afef;">for</span> i <span style="color: #51afef;">in</span> datos_simus[<span style="color: #98be65;">"Nombre"</span>]:
    <span style="color: #dcaeea;">data</span> = {<span style="color: #98be65;">"name"</span>:i,
            <span style="color: #98be65;">"lugar_extraido"</span>:<span style="color: #98be65;">"simus"</span>}
    colombia_scene_list.append(data)

<span style="color: #dcaeea;">colombia_state_names</span> = pd.DataFrame(colombia_scene_list)
<span style="color: #5B6268;">#</span>
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">guardo los datos para vincularlos posteriormente con spotify y con youtube</span>
colombia_state_names.to_csv(<span style="color: #98be65;">"nombres_bandas_generados.csv"</span>)
<span style="color: #51afef;">print</span>(colombia_state_names.tail(<span style="color: #da8548; font-weight: bold;">5</span>))
</pre>
</div>

<pre class="example">
                                                   name lugar_extraido
1239  Semillero escuela Municipal de música de Piendamó          simus
1240                   Chirimia del Pacifico Colombiano          simus
1241            ESCUELA DE FORMACION MUSICAL PAEZ VIVE           simus
1242                                   Pal' Lereo Pabla          simus
1243                                       Mar a fuera           simus
</pre>
</div>
</div>
</div>

<div id="outline-container-org10b9772" class="outline-3">
<h3 id="org10b9772"><span class="section-number-3">1.2.</span> Merge con Spotify:</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org816b6f5" class="outline-4">
<h4 id="org816b6f5"><span class="section-number-4">1.2.1.</span> Concepto</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Spotify cuenta con una API bastante completa que suministra mucha información
sobre las bandas que se encuentran en esta plataforma. Ya que se tiene un
dataset con muchos nombres de bandas que suenan en la escena de
la música colombiana, ahora lo que busco es enriquecer los datos que tengo
buscando los nombres de las bandas en spotify y extrayendo sus features. En un
proyecto anterior, junto con Juan Pablo, habíamos hecho una clase que funcionaba
dentro de la API de spotify para relacionar nombres de artistas con sus
respectivos ids en spotify
</p>
</div>
</div>
