data_gathering/informe_data_gathering/primer_concepto.org
*** Proceso de enriquecer los datos:
previamente se almacenaron los datos en "nombres_bandas_generados.csv" , lo que
busco es asociar a cada artista con su respectivo id de spotify con el fin de
luego poder extraer la información correspondiente a este

*fue muy pesado el script que hacía el merge por lo que me tocó correrlo como un script aparte que está en el repositorio pero no se puede correr desde el documento*, de todas formas, los datos sobre los que se va a trabajar el proyecto son estos (aunque luego se podrían adjuntar matrices respectivas a las músicas de cada artista de ser pertinente)
#+begin_src python :results output :exports both :session simus
import pandas as pd
final_data = pd.read_csv("final_data.csv")
print(final_data.head(4))
print(final_data.columns)
print(final_data.shape)
#+end_src

#+RESULTS:
#+begin_example
   Unnamed: 0      name_scrapped                      id                                       link_spotify  followers  ... popularidad  nombre_en_spotify  type_of_artist           lugar_extraido index_on_last_dataset
0           0            Shakira  <built-in function id>  https://open.spotify.com/artist/0EmeFodog0BfCg...   22483270  ...          85            Shakira  <class 'type'>  pagina_artistas_famosos                     1
1           1             Juanes  <built-in function id>  https://open.spotify.com/artist/0UWZUmn7sybxMC...    3438332  ...          77             Juanes  <class 'type'>  pagina_artistas_famosos                     2
2           2      Mateo Camargo  <built-in function id>                                    not in database          0  ...           0    not in database  <class 'type'>  pagina_artistas_famosos                     3
3           3  Alfredo Gutierrez  <built-in function id>  https://open.spotify.com/artist/7esYnrPzQX1JWW...      77452  ...          47  Alfredo Gutierrez  <class 'type'>  pagina_artistas_famosos                     4

[4 rows x 12 columns]
Index(['Unnamed: 0', 'name_scrapped', 'id', 'link_spotify', 'followers',
       'generos', 'imagenes', 'popularidad', 'nombre_en_spotify',
       'type_of_artist', 'lugar_extraido', 'index_on_last_dataset'],
      dtype='object')
(1244, 12)
#+end_example

* Razón por la cuál elegimos esta base de datos:
** 1
porque junto con Juan Pablo nos divertimos haciendo proyectos relacionados con música ya que siempre descubrimos bandas excelentes. Además, porque tiene sentido estudiar la música que consumimos.
** 2
porque el hecho de que no existan datasets sobre el tema implica que es un tema que nadie ha estudiado con rigurosidad, y este análisis le puede servir a promotores de la industria musical o a bandas de amigos que quieran tomar estrategias para aumentar su popularidad.
** 3
porque este proyecto puede revelar un panorama muy interesante de la música en Colombia

* Qué métodos pueden potencialmente aplicarse con dicha base de datos.
** Respecto a la comparación:
Se pueden usar métodos de comparación para ver que factores influyen en la popularidad de un artista en Colombia
** Respecto a la clasificación:
Se puede intentar aplicar métodos de regresiones logísticas para saber si un artista, según sus features, va a ser popular o no
** Respecto al clustering:
Se puede aplicar modelos de clustering como Kmeans para entender que tipos de bandas suenan en nuestro país
** Respecto a la reducción de dimensionalidad:
Se puede reducir la dimensión de las matrices de los mel-espectrogramas de
canciones de los artistas para poder visualizar en un plano un panorama completo de la música
colombiana (que en realidad es mi meta personal con este proyecto.) , con esto,
tener una visión mas clara de como se mueve la onda musical en Bogotá.
