data_gathering/informe_data_gathering/primer_concepto.html

<div id="outline-container-orgf790ba0" class="outline-4">
<h4 id="orgf790ba0"><span class="section-number-4">1.2.2.</span> Proceso de enriquecer los datos:</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
previamente se almacenaron los datos en &ldquo;nombres<sub>bandas</sub><sub>generados.csv</sub>&rdquo; , lo que
busco es asociar a cada artista con su respectivo id de spotify con el fin de
luego poder extraer la información correspondiente a este
</p>

<p>
<b>fue muy pesado el script que hacía el merge por lo que me tocó correrlo como un script aparte que está en el repositorio pero no se puede correr desde el documento</b>, de todas formas, los datos sobre los que se va a trabajar el proyecto son estos (aunque luego se podrían adjuntar matrices respectivas a las músicas de cada artista de ser pertinente)
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">import</span> pandas <span style="color: #51afef;">as</span> pd
<span style="color: #dcaeea;">final_data</span> = pd.read_csv(<span style="color: #98be65;">"final_data.csv"</span>)
<span style="color: #51afef;">print</span>(final_data.head(<span style="color: #da8548; font-weight: bold;">4</span>))
<span style="color: #51afef;">print</span>(final_data.columns)
<span style="color: #51afef;">print</span>(final_data.shape)
</pre>
</div>

<pre class="example" id="org2c63a06">
   Unnamed: 0      name_scrapped                      id                                       link_spotify  followers  ... popularidad  nombre_en_spotify  type_of_artist           lugar_extraido index_on_last_dataset
0           0            Shakira  &lt;built-in function id&gt;  https://open.spotify.com/artist/0EmeFodog0BfCg...   22483270  ...          85            Shakira  &lt;class 'type'&gt;  pagina_artistas_famosos                     1
1           1             Juanes  &lt;built-in function id&gt;  https://open.spotify.com/artist/0UWZUmn7sybxMC...    3438332  ...          77             Juanes  &lt;class 'type'&gt;  pagina_artistas_famosos                     2
2           2      Mateo Camargo  &lt;built-in function id&gt;                                    not in database          0  ...           0    not in database  &lt;class 'type'&gt;  pagina_artistas_famosos                     3
3           3  Alfredo Gutierrez  &lt;built-in function id&gt;  https://open.spotify.com/artist/7esYnrPzQX1JWW...      77452  ...          47  Alfredo Gutierrez  &lt;class 'type'&gt;  pagina_artistas_famosos                     4

[4 rows x 12 columns]
Index(['Unnamed: 0', 'name_scrapped', 'id', 'link_spotify', 'followers',
       'generos', 'imagenes', 'popularidad', 'nombre_en_spotify',
       'type_of_artist', 'lugar_extraido', 'index_on_last_dataset'],
      dtype='object')
(1244, 12)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org482fe9d" class="outline-2">
<h2 id="org482fe9d"><span class="section-number-2">2.</span> Razón por la cuál elegimos esta base de datos:</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd32f92e" class="outline-3">
<h3 id="orgd32f92e"><span class="section-number-3">2.1.</span> 1</h3>
<div class="outline-text-3" id="text-2-1">
<p>
porque junto con Juan Pablo nos divertimos haciendo proyectos relacionados con música ya que siempre descubrimos bandas excelentes. Además, porque tiene sentido estudiar la música que consumimos.
</p>
</div>
</div>
<div id="outline-container-orgb7eeaf6" class="outline-3">
<h3 id="orgb7eeaf6"><span class="section-number-3">2.2.</span> 2</h3>
<div class="outline-text-3" id="text-2-2">
<p>
porque el hecho de que no existan datasets sobre el tema implica que es un tema que nadie ha estudiado con rigurosidad, y este análisis le puede servir a promotores de la industria musical o a bandas de amigos que quieran tomar estrategias para aumentar su popularidad.
</p>
</div>
</div>
<div id="outline-container-org1d4f98d" class="outline-3">
<h3 id="org1d4f98d"><span class="section-number-3">2.3.</span> 3</h3>
<div class="outline-text-3" id="text-2-3">
<p>
porque este proyecto puede revelar un panorama muy interesante de la música en Colombia
</p>
</div>
</div>
</div>

<div id="outline-container-orgbb9984b" class="outline-2">
<h2 id="orgbb9984b"><span class="section-number-2">3.</span> Qué métodos pueden potencialmente aplicarse con dicha base de datos.</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf263654" class="outline-3">
<h3 id="orgf263654"><span class="section-number-3">3.1.</span> Respecto a la comparación:</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Se pueden usar métodos de comparación para ver que factores influyen en la popularidad de un artista en Colombia
</p>
</div>
</div>
<div id="outline-container-org4204764" class="outline-3">
<h3 id="org4204764"><span class="section-number-3">3.2.</span> Respecto a la clasificación:</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Se puede intentar aplicar métodos de regresiones logísticas para saber si un artista, según sus features, va a ser popular o no
</p>
</div>
</div>
<div id="outline-container-org986526c" class="outline-3">
<h3 id="org986526c"><span class="section-number-3">3.3.</span> Respecto al clustering:</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Se puede aplicar modelos de clustering como Kmeans para entender que tipos de bandas suenan en nuestro país
</p>
</div>
</div>
<div id="outline-container-org09f10b4" class="outline-3">
<h3 id="org09f10b4"><span class="section-number-3">3.4.</span> Respecto a la reducción de dimensionalidad:</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Se puede reducir la dimensión de las matrices de los mel-espectrogramas de
canciones de los artistas para poder visualizar en un plano un panorama completo de la música
colombiana (que en realidad es mi meta personal con este proyecto.) , con esto,
tener una visión mas clara de como se mueve la onda musical en Bogotá.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Rodrigo Castillo, Alejandra Campo, Gran Maestro Chamán.</p>
<p class="date">Created: 2021-10-22 Fri 15:10</p>
</div>
</body>
</html>
