data_gathering/informe_data_gathering/primer_concepto.tex

\subsubsection{Proceso de enriquecer los datos:}
\label{sec:org441e814}
previamente se almacenaron los datos en ``nombres\textsubscript{bandas}\textsubscript{generados.csv}'' , lo que
busco es asociar a cada artista con su respectivo id de spotify con el fin de
luego poder extraer la información correspondiente a este

\textbf{fue muy pesado el script que hacía el merge por lo que me tocó correrlo como un script aparte que está en el repositorio pero no se puede correr desde el documento}, de todas formas, los datos sobre los que se va a trabajar el proyecto son estos (aunque luego se podrían adjuntar matrices respectivas a las músicas de cada artista de ser pertinente)
\begin{verbatim}
import pandas as pd
final_data = pd.read_csv("final_data.csv")
print(final_data.head(4))
print(final_data.columns)
print(final_data.shape)
\end{verbatim}

\begin{verbatim}
   Unnamed: 0      name_scrapped                      id                                       link_spotify  followers  ... popularidad  nombre_en_spotify  type_of_artist           lugar_extraido index_on_last_dataset
0           0            Shakira  <built-in function id>  https://open.spotify.com/artist/0EmeFodog0BfCg...   22483270  ...          85            Shakira  <class 'type'>  pagina_artistas_famosos                     1
1           1             Juanes  <built-in function id>  https://open.spotify.com/artist/0UWZUmn7sybxMC...    3438332  ...          77             Juanes  <class 'type'>  pagina_artistas_famosos                     2
2           2      Mateo Camargo  <built-in function id>                                    not in database          0  ...           0    not in database  <class 'type'>  pagina_artistas_famosos                     3
3           3  Alfredo Gutierrez  <built-in function id>  https://open.spotify.com/artist/7esYnrPzQX1JWW...      77452  ...          47  Alfredo Gutierrez  <class 'type'>  pagina_artistas_famosos                     4

[4 rows x 12 columns]
Index(['Unnamed: 0', 'name_scrapped', 'id', 'link_spotify', 'followers',
       'generos', 'imagenes', 'popularidad', 'nombre_en_spotify',
       'type_of_artist', 'lugar_extraido', 'index_on_last_dataset'],
      dtype='object')
(1244, 12)
\end{verbatim}

\section{Razón por la cuál elegimos esta base de datos:}
\label{sec:org221346a}
\subsection{1}
\label{sec:org1ce1ac4}
porque junto con Juan Pablo nos divertimos haciendo proyectos relacionados con música ya que siempre descubrimos bandas excelentes. Además, porque tiene sentido estudiar la música que consumimos.
\subsection{2}
\label{sec:org51d3326}
porque el hecho de que no existan datasets sobre el tema implica que es un tema que nadie ha estudiado con rigurosidad, y este análisis le puede servir a promotores de la industria musical o a bandas de amigos que quieran tomar estrategias para aumentar su popularidad.
\subsection{3}
\label{sec:org9e7db43}
porque este proyecto puede revelar un panorama muy interesante de la música en Colombia

\section{Qué métodos pueden potencialmente aplicarse con dicha base de datos.}
\label{sec:orgec54276}
\subsection{Respecto a la comparación:}
\label{sec:org6b34803}
Se pueden usar métodos de comparación para ver que factores influyen en la popularidad de un artista en Colombia
\subsection{Respecto a la clasificación:}
\label{sec:org472cf74}
Se puede intentar aplicar métodos de regresiones logísticas para saber si un artista, según sus features, va a ser popular o no
\subsection{Respecto al clustering:}
\label{sec:orge6254d7}
Se puede aplicar modelos de clustering como Kmeans para entender que tipos de bandas suenan en nuestro país
\subsection{Respecto a la reducción de dimensionalidad:}
\label{sec:orgaca0c0f}
Se puede reducir la dimensión de las matrices de los mel-espectrogramas de
canciones de los artistas para poder visualizar en un plano un panorama completo de la música
colombiana (que en realidad es mi meta personal con este proyecto.) , con esto,
tener una visión mas clara de como se mueve la onda musical en Bogotá.
\end{document}
